{"Bitacora/Bitacora":{"title":"Bitacora","links":["garry.net"],"tags":["bitacora"],"content":"Aquí iré añadiendo reflexiones del día a día a modo de diario (siempre que pueda), con el objetivo de que al escribirlas en ocasiones me lleve a profundizar más algunos temas, así como el hecho de compartir un poco experiencias personales, y ya de paso tenerlo todo recogido para poder echar la vista atrás y ver la evolución.\n25-07-2024: §\nPor recomendación me he leído el manhwa entero de “Solo Leveling”. Tengo que decir que a pesar de parecer el típico shonen, esta muuuy bien llevado a cabo, se nota como los coreanos han llegado con ideas frescas que exploran muy bien tópicos ya establecidos y le dan un giro. En ese sentido, es increíble como está pensado para leerse desde el móvil, lo ajustan a la resolución y forma de scrollear y hace que sea increíblemente dinámico al leerlo. Comparandolo con el anime es que es como si ya lo hubieras visto, los efectos especiales y movimientos están muy bien recogidos de tal manera que es fácil de imaginar. Algo que creo genuinamente que no consiguen tanto la mayoría de mangas. También es importante que estén a todo color y no en blanco y negro, hay muchas más dimensiones para la expresión artística, y recoge mejor lo que se puede llegar a hacer hoy en día en diseño gráfico.\n30-01-2025:\nHe estado jugando al Satisfactory y al Factorio ultimamente, grandes juegos de automatización. Me ha hecho darme cuenta (otra vez) de que sentirte productivo en los juegos también hace que se extienda hacia el humor de tu día y te sientas más proactivo a realizar tareas. [buscar más: seguramente sea un efecto ya estudiado]. Por otra parte, me gustaría algún día hacer una iteración de ambos. Prefiero por mucho las posibilidades de la construcción en 3D de Satisfactory, pero es mucho más fácil construir en Factorio, y la clave es que los blueprints para copiar/pegar no se desbloquean hasta mid-game y son muy limitados. Como siempre los mods los solucionan, pero hay mucho por explorar en ese campo, porque es uno de los motivos de que la gente abandone llegado a cierta complejidad, mentalmente sabes cómo resolverlo pero no dan ganas de meterse en ese berenjenal por el coste de tiempo que llevará, la curva de dificultad en el diseño ha de tener en cuenta los obstáculos mentales. [Buscar más] Este fenómeno ocurre mucho en programación, cuando tienes un problema que sabes que es resoluble a corto plazo, uno se enfrasca y disfruta, pero si aunque sea resoluble sabes que te llevará más, empiezas a posponerlo porque ya el coste tiempo-energía supone una barrera cognitiva. Daniel Kahneman lo explica bastante bien en el libro “Pensar rápido, pensar despacio”.\n02-02-2025:\nVolviendo al piso de noche he recordado el olor de las escaleras y el piso de mis abuelos, me encanta este piso porque huele igual, creo que es el limpiasuelos del rellano, pero hay algo más que no identifico. Me apunto el escribir sobre los olores de la infancia, aquellos que forjan recuerdos de por vida. Y de paso, el de los recuerdos de infancia en general, como el impacto que tuvo algunos videojuegos, ahora que veo salir de nuevo en Steam la colección de los Sims 1 y 2.\n04-02-2025:\nHe re-descubierto el blog de Garry Newman, y me ha recordado la importancia de escribir las ideas y de qué divertido es leer las de otros. Me ha encantado el post sobre el “Handshake Game” en el que tienes que averigüar a cuantos apretones de mano estás de alguien famoso-importante. Me ha hecho pensar que estoy a 2 de Chomsky, ya que mi profesor de filosofía política en la carrera le dió la mano, e incluso hizo amistad y le escribió el prólogo de su libro. También le dí la mano a López-Catalán, presidente de Genera Games (donde trabajaba), y vicepresidente del Betis. Este le dió la mano a Pellegrini&gt;Florentino&gt;Rey y de ahí al infinito. También me hace gracia pensar que estoy a 2 del expresidente de Sega, Hayao Nakayama, que una vez vino a visitar GeneraGames.\n11-02-2025:\nHay días más productivos y otros que no tienes ganas de nada. Hoy recordé por qué un día decidí que quería ganar mucho dinero, y no para mí, sino para poder ayudar a otras personas. En esos días, hasta las tareas mundanas cobran sentido, vas a hacer la compra con tenacidad, comes con tenacidad, limpias con tenacidad, etc. Bastante cómico visto desde fuera la verdad, pero es curioso como se vive distinto, es como si toda la motivación del mundo te inundara y durante ese día te sientes imparable. Pero es difícil mantenerlo, porque la mente tiene días mejores y peores.\n14-02-2025:\nCuando uno se pone a desarrollar un videojuego conviene recordar esta cita célebre sobre el problema del último 10%:\n“The first 90 percent of the code accounts for the first 90 percent of the development time. The remaining 10 percent of the code accounts for the other 90 percent of the development time.” -Tom Cargill, Bell Labs.\n16-02-2025:\nHe visto las pelis de “13 lives” y “The help” y las recomiendo plenamente, son muy bonitas y el storytelling es brutal. He recordado por qué en la primera, Viggo Mortensen es un actorazo. En la segunda, se salen Viola Davis, Octavia Spencer y Emma Stone. Una pasada.\n20-02-2025:\nHe visto la primera temporada del anime ChainsawMan (12 caps). Al principio no me convencía, ya que parece el típico shonen, y hay una parte muy típica japonesa que es la del personaje salido con las tías. Pero me quedé porque me gustó el concepto de los demonios y los pactos con los humanos. También porque soy débil al tema tópico de que hay un personaje superior que esconde una sabiduría mucho más profunda sobre el universo en el que están, y te engancha para ver como el protagonista lo va descubriendo poco a poco. Well played.\n24-02-2025:\nLa serie de Severance es absolutamente genial. Hoy, leyendo artículos National Geographic, he descubierto que el edificio en el que se graba es el que fue de Bell Labs, ¡ya me sonaba de algo! Es un espacio que me encanta profundamente por lo que representó y como el arquitecto Eero Saarinen, antes de morir, plasmó este edificio emblemático. También aprendí que este edificio ahora pertenece a Nokia, empresa que curiosamente ya no se dedica a hacer los míticos móviles. Y también que se usa para todo tipo de eventos culturales, espacios de coworking, etc. Interesante, me alegra ver esta evolución, ya que como cuentan en el primer artículo después de perder la financiación para la investigación casi acaba siendo derrumbado. Algún día, si todo saliese bien, me encantaría montar un edificio así, aunque fuese en miniatura, para poder llevar a cabo mi proyecto de “universidad”[].\n25-02-2025:\nLlevo días y días aprendiendo más Blender y refinando el modelo principal de mi juego para que sea modular, estoy contento con los resultados tanto técnicamente como artísticamente. Por lo primero porque estoy intentando llevar a cabo buenas prácticas, que no tenga muchos polígonos de más, que los uvs esten aprovechados y las texturas no sean mas grandes de lo que necesiten, entre otras cosas. Por lo segundo, porque nace de la inspiración por los modelos de Animal Crossing, y aunque al principio me acerqué demasiado al original para aprender, ahora que he aprendido sobre proporciones y he observado montones de artistas sobre concept art y personajes, estoy sintetizando ideas que al menos de momento no he visto en otro juego. Tiene la cabeza más pequeña para permitir un movimiento más dinámico al añadir combate (no podría girar sobre el suelo con el tamaño del original), brazos y piernas más gorditos, así como el torso mas corto, para que las proporciones sean mas “chonky”; se acerca al mario odyssey, pero no tan corto para permitir variabilidad de estilos en ropa y personalización. Al final son miles de detalles que tienes que tener en cuenta para refinar la experiencia de juego que quieres, y que vas descubriendo a base equivocarte y ver por qué es mejor así y no asá. Siento que podría estar todo el día hablando sobre proporciones en arte xd, en fin. Algún día espero formalizarlo en algún artículo con la profundidad que se merece, así como escribir un postmortem del juego.\n26-02-2025:\nEsta mañana, un amigo ha compartido este post de josealberto, sobre el mal de las apps, y un poco en línea sobre escapar del monopolio que las bigtech tienen sobre los medios de comunicación contemporáneos, etc. Me ha recordado a este post de Garry Newman que en la parte de apps habla de lo mismo. El otro punto curioso es que las apps de móvil, son en su mayoría, webs, ya que están desarrolladas en React por motivos de ahorro y para que sean multiplataforma, pocas son las que estén hechas nativamente para la plataforma. Y desde esa perspectiva, ¿para qué ser una app? pues básicamente por las notificaciones y por el rastreo/cookies, y porque nos hemos acomodado a este mundo de apps, pero no tendría por qué ser así. Los protocolos de comunicación deberían ser libres por ley, para que nadie pueda monopolizarlos, para que cada uno entre desde el cliente que prefiera. Así es el correo, y ahora, tenemos Mastodon para el microblogging, o en el futuro, según prometen, Bluesky. Para la mensajería instantánea teníamos IRC, y hoy en día diría que el standard es XMPP, pero son totalmente desconocidas para la mayoría. Por eso hace falta mayor divulgación a favor del software libre, tanto a mayores como estudiantes de instituto, etc. De lo contrario nos veremos conducidos cada vez más a un internet menos libre, dependientes de 4 mega-empresas que lo controlen todo, sino es que estamos ya ahí."},"Proyectos/Proyectos":{"title":"Proyectos","links":[],"tags":["projects"],"content":"Tengo varios proyectos entre manos, y muchos más en el tintero. Algunos para un futuro casi imposible, pero aún así me gustaría escribir sobre ellos:\n1.\n"},"index":{"title":"Welcome fellow human!","links":["Las-anecdotas"],"tags":[],"content":"¡Hola! Soy Ulises y este es mi pequeño jardín digital (hypertext).\nActualmente desarrollo de manera independiente un videojuego que saldrá pronto en Steam. Anteriormente he hecho muchos proyectos de software como freelance, trabajaba como ingeniero de Devops/SRE en Genera Games, y antes de eso entré como QA, pero estudié la carrera de Filosofía, ya que me mueve la pura curiosidad y por ello ante todo me considero generalista.\nAquí comparto pensamientos que nacen del día a día en la bitácora, intentos de ensayo que espero profundizar poco a poco, anécdotas, y proyectos con los que estoy o tengo en mente realizar durante mi vida. En este sentido, creo que es importante que compartamos un cachito de nuestras experiencias personales, alimentar nuestra curiosidad, y poder ser influenciado asimismo por otros, como ya lo hicieron ciertas amistades y otros blogs que dejaré por aquí abajo.\nCreo que es fundamental para crecer como humanos que profundicemos en los temas que nos interesan, que aprendamos de otros, de sus historias, sus Las anecdotas, sus proyectos y de nuestros errores, y esto es limitado en el día a día por las interacciones personales. Por otro lado, internet nos habilita intercomunicarnos estés donde estés y a la hora que prefieras, sin embargo, en el día a día la mayoría de la gente solo usa las redes sociales para micro-interacciones sin mayor profundidad, y eso está bien para lo que es, pero compartir un pensamiento más estructurado es imposible. Por eso reivindico la vuelta a los espacios personales para compartir ese tipo de experiencia, que quede escrita, que por algo es el mejor invento de la humanidad.\n[!note] Nota\nPor supuesto, es difícil tener tiempo para compartir todos los pensamientos de la manera en que me gustaría, o para completar todos los proyectos que querría. Pero es muy importante tener en cuenta el [efecto de parálisis por análisis] por un lado, y por otro, de que siempre se puede [revisar] lo escrito. Es por ello que es a tener en cuenta que muchos escritos están a medio acabar o son simplemente bocetos de lo que me gustaría, pero si uno nunca empieza, que ya me costó para arrancar aquí, nunca termina. Y eso que lo importante no es terminar, -viaje antes que destino.\n[!quote] Cita\n“[One] who works with the door open gets all kinds of interruptions, but [they] also occasionally gets clues as to what the world is and what might be important.” — Richard Hamming"}}